grid = [['.', '.', '.', '.', '.', '.'],
        ['.', 'o', 'o', '.', '.', '.'],
        ['o', 'o', 'o', 'o', '.', '.'],
        ['o', 'o', 'o', 'o', 'o', '.'],
        ['.', 'o', 'o', 'o', 'o', 'o'],
        ['o', 'o', 'o', 'o', 'o', '.'],
        ['o', 'o', 'o', 'o', '.', '.'],
        ['.', 'o', 'o', '.', '.', '.'],
        ['.', '.', '.', '.', '.', '.']]

for y in range(len(grid[0])):
#変数yを0～5までfor文で回す。インデックスの数字自体が取れればいいので、リストの複製はしなくて良さそう
    for x in range(len(grid)):
    #変数xを0～8までfor文で回す。ここもリストの複製はしない。
        print(grid[x][::-1][y], end='')
		#ここで、リストinリストの中身だけ逆順に並べたものの複製を使う。
    print()
